"Share on Facebook" = "حصة في الفيسبوك";
"Share on Twitter" = "حصة على التغريد";
"Share on Email" = "مشاركة على البريد الإلكتروني";
"Cancel" = "إلغاء";
"Close" = "قريب";
"All" = "جميع";
"Submit" = "يقدم";